#include <iostream>
#include <utility> // Для std::swap для решения проблемы не рабочего swap пришлось прочесать интернет
    //Задача 2. Обмен местами

int main() {
    int a = 42;
    int b = 153;
    std::cout << "=============================\n";
    std::cout << "a: " << a << "\n"; /* На экран будет выведено 42 */
    std::cout << "b: " << b << "\n"; /* На экран будет выведено 153 */
    std::cout << "=============================\n";
    
    std::swap(a, b); /* Меняем значения */
    
    std::cout << "a: " << a << "\n"; /* На экран будет выведено 153 */
    std::cout << "b: " << b << "\n"; /* На экран будет выведено 42 */
    std::cout << "=============================\n";
    }