#include <iostream>

int main() {
    int dailyGrowth;           // Ежедневный рост   
    std::cout << "================================================================================================================\n";
    std::cout << "Введите ежедневный рост бамбука в сантиметрах: ";
    std::cin >> dailyGrowth; // Вводим ежедневный рост бамбука
    std::cout << "================================================================================================================\n";
                                  
    int nightFade;             // Еженочное съедание    
    std::cout << "Введите на сколько каждую ночь схедают бамбук гусеницы в сантиметрах но не более:" << dailyGrowth / 4 *3 << " см.\n";
    std::cin >> nightFade; // Вводим на сколько каждую ночь съедают бамбук гусеницы  
    std::cout << "================================================================================================================\n";  

    int beginHeight = 100;          // начальный рост                               
    
    int thirdDayGrowth = dailyGrowth * 2 + dailyGrowth / 2;                            // На сколько вырастет бамбук к СЕРЕДИНЕ 3 дня (2 дня + 1/2 дня)
    int thirdDayLosses = nightFade * 2;                                                // На сколько съедят гусеницы к СЕРЕДИНЕ 3 дня (2 ночи)
    int thirdDayHeight = beginHeight + thirdDayGrowth - thirdDayLosses;                // Высота бамбука к СЕРЕДИНЕ 3 дня (начальный рост + на сколько вырастет - на сколько съедят гусеницы)

    std::cout << "Высота бамбука к середине 3 дня: " << thirdDayHeight << ".\n";
    std::cout << "================================================================================================================\n";


}