#include <iostream>
    //Задача 2. Обмен местами без использования std::swap

int main() {
    int a = 42;
    int b = 153;
    int temp; // Временная переменная для хранения значения
    temp = a; // Сохраняем значение a во временной переменной
    std::cout << "=============================\n";
    std::cout << "a: " << a << "\n"; /* На экран будет выведено 42 */
    std::cout << "b: " << b << "\n"; /* На экран будет выведено 153 */
    std::cout << "=============================\n";
    
    std::cout << "a: " << b << "\n"; /* На экран будет выведено 153 */
    std::cout << "b: " << temp << "\n"; /* На экран будет выведено 42 */
    std::cout << "=============================\n";
    }